mustafaylmz1995/tm4c1294NCPDT_hfiles/KEIL_lib/TM4C1294NCPDT_sys/startup_TM4C129.c
///* reset handler -----------------------------------------------------------*/
//void Reset_Handler(void) {
//    extern int main(void);
//    extern int __libc_init_array(void);
//    extern unsigned __data_start;  /* start of .data in the linker script */
//    extern unsigned __data_end__;  /* end of .data in the linker script */
//    extern unsigned const __data_load; /* initialization values for .data  */
//    extern unsigned __bss_start__; /* start of .bss in the linker script */
//    extern unsigned __bss_end__;   /* end of .bss in the linker script */
//    extern void software_init_hook(void) __attribute__((weak));

//    unsigned const *src;
//    unsigned *dst;

//    SystemInit(); /* CMSIS system initialization */

//    /* copy the data segment initializers from flash to RAM... */
//    src = &__data_load;
//    for (dst = &__data_start; dst < &__data_end__; ++dst, ++src) {
//        *dst = *src;
//    }

//    /* zero fill the .bss segment in RAM... */
//    for (dst = &__bss_start__; dst < &__bss_end__; ++dst) {
//        *dst = 0;
//    }

//    /* init hook provided? */
//    if (&software_init_hook != (void (*)(void))(0)) {
//        /* give control to the RTOS */
//        software_init_hook(); /* this will also call __libc_init_array */
//    }
//    else {
//        /* call all static constructors in C++ (harmless in C programs) */
//        __libc_init_array();
//        (void)main(); /* application's entry point; should never return! */
//    }

//    /* the previous code should not return, but assert just in case... */
//    assert_failed("Reset_Handler", __LINE__);
//}



///* fault exception handlers ------------------------------------------------*/
//__attribute__((naked)) void NMI_Handler(void);
//void NMI_Handler(void) {
//    __asm volatile (
//        "    ldr r0,=str_nmi\n\t"
//        "    mov r1,#1\n\t"
//        "    b assert_failed\n\t"
//        "str_nmi: .asciz \"NMI\"\n\t"
//        "  .align 2\n\t"
//    );
//}
///*..........................................................................*/
//__attribute__((naked)) void MemManage_Handler(void);
//void MemManage_Handler(void) {
//    __asm volatile (
//        "    ldr r0,=str_mem\n\t"
//        "    mov r1,#1\n\t"
//        "    b assert_failed\n\t"
//        "str_mem: .asciz \"MemManage\"\n\t"
//        "  .align 2\n\t"
//    );
//}
///*..........................................................................*/
//__attribute__((naked)) void HardFault_Handler(void);
//void HardFault_Handler(void) {
//    __asm volatile (
//        "    ldr r0,=str_hrd\n\t"
//        "    mov r1,#1\n\t"
//        "    b assert_failed\n\t"
//        "str_hrd: .asciz \"HardFault\"\n\t"
//        "  .align 2\n\t"
//    );
//}
///*..........................................................................*/
//__attribute__((naked)) void BusFault_Handler(void);
//void BusFault_Handler(void) {
//    __asm volatile (
//        "    ldr r0,=str_bus\n\t"
//        "    mov r1,#1\n\t"
//        "    b assert_failed\n\t"
//        "str_bus: .asciz \"BusFault\"\n\t"
//        "  .align 2\n\t"
//    );
//}
///*..........................................................................*/
//__attribute__((naked)) void UsageFault_Handler(void);
//void UsageFault_Handler(void) {
//    __asm volatile (
//        "    ldr r0,=str_usage\n\t"
//        "    mov r1,#1\n\t"
//        "    b assert_failed\n\t"
//        "str_usage: .asciz \"UsageFault\"\n\t"
//        "  .align 2\n\t"
//    );
//}
///*..........................................................................*/
//__attribute__((naked)) void Default_IRQHandler(void);
//void Default_IRQHandler(void) {
//    __asm volatile (
//        "    ldr r0,=str_dflt\n\t"
//        "    mov r1,#1\n\t"
//        "    b assert_failed\n\t"
//        "str_dflt: .asciz \"Default\"\n\t"
//        "  .align 2\n\t"
//    );
//}

///*****************************************************************************
//* The function assert_failed defines the error/assertion handling policy
//* for the application. After making sure that the stack is OK, this function
//* calls Q_onAssert, which should NOT return (typically reset the CPU).
//*
//* NOTE: the function Q_onAssert should NOT return.
//*****************************************************************************/
//__attribute__ ((naked))
//void assert_failed(char const *module, int loc) {
//    /* re-set the SP in case of stack overflow */
//    __asm volatile (
//        "  MOV sp,%0\n\t"
//        : : "r" (&__stack_end__));

//    Q_onAssert(module, loc); /* call the application-specific QP handler */

//    for (;;) { /* should not be reached, but just in case loop forever... */
//    }
//}

/****** End Of File *********************************************************/
